# St7SetBeamCableAsLine

Sets the option for cables to ignore the beam style and use bsLine instead.

long St7SetBeamCableAsLine(long uID, bool AsLine)

Input Parameters

uID

Strand7 model file ID.

AsLine

If True, the cable is rendered using the bsLine style.

If False, the cable is rendered using the set beam style.